In [12]:
import pandas as pd
Credit = pd.read_csv(r"C:\Users\ASUS\Downloads\Credit Banking_Project1.csv", encoding="UTF-8")
print(Credit)

    Sl No: Customer      Age        City Credit Card Product            Limit  \
0        1       A1   0.9285   BANGALORE                Gold  INR 5,00,000.00
1        2       A2  35.5346    CALCUTTA              Silver  INR 1,00,000.00
2        3       A3  11.5593      COCHIN            Platimum    INR 10,000.00
3        4       A4  45.8203      BOMBAY            Platimum    INR 10,001.00
4        5       A5  69.6639   BANGALORE            Platimum    INR 10,002.00
..     ...      ...      ...         ...                 ...              ...
95      96      A96  29.6316     CHENNAI              Silver  INR 1,00,000.00
96      97      A97  20.6118  TRIVANDRUM            Platimum    INR 10,000.00
97      98      A98  40.5390    CALCUTTA            Platimum    INR 10,001.00
98      99      A99  21.5887    CALCUTTA            Platimum    INR 10,002.00
99     100     A100  23.6076      COCHIN              Silver  INR 1,00,000.00

   Company        Segment
0       C1  Self Employed
1       C2   Salaried_MNC
2       C3   Salaried_Pvt
3       C4           Govt
4       C5  Normal Salary
..     ...            ...
95     C19   Salaried_Pvt
96     C20           Govt
97     C21  Normal Salary
98     C22  Self Employed
99      C5   Salaried_MNC

[100 rows x 8 columns]

In [10]:
repay= pd.read_csv(r"C:\Users\ASUS\Downloads\repayment.csv", encoding= "UTF-8")
print(repay)

      SL No: Costomer      Month         Amount  Unnamed: 4
0        1.0       A1  12-Jan-04  331844.007400         NaN
1        2.0       A1   3-Jan-04  441139.807300         NaN
2        3.0       A1  15-Jan-04   32480.004010         NaN
3        4.0       A1  25-Jan-04   90636.966530         NaN
4        5.0       A1  17-Jan-05    1581.969829         NaN
...      ...      ...        ...            ...         ...
1518     NaN      NaN        NaN            NaN         NaN
1519     NaN      NaN        NaN            NaN         NaN
1520     NaN      NaN        NaN            NaN         NaN
1521     NaN      NaN        NaN            NaN         NaN
1522     NaN      NaN        NaN            NaN         NaN

[1523 rows x 5 columns]

In [13]:
Spend=  pd.read_csv(r"C:\Users\ASUS\Downloads\spend.csv", encoding= "UTF-8")
print(Spend)

      Sl No: Costomer      Month        Type  Amount
0          1       A1  12-Jan-04   JEWELLERY  473776
1          2       A1   3-Jan-04       PETRO  335579
2          3       A1  15-Jan-04     CLOTHES  371041
3          4       A1  25-Jan-04        FOOD  141178
4          5       A1  17-Jan-05      CAMERA  398404
...      ...      ...        ...         ...     ...
1495    1496      A67   4-Feb-06  BUS TICKET  195841
1496    1497      A68  25-Mar-06  BUS TICKET  284263
1497    1498      A69  31-Mar-06  BUS TICKET  206552
1498    1499      A70  23-Mar-06  BUS TICKET   41025
1499    1500      A71  24-Mar-06  BUS TICKET  101398

[1500 rows x 5 columns]

In [14]:
repay.rename(columns={"Costomer":"Customer"},inplace= True)
repay

      SL No: Customer      Month         Amount  Unnamed: 4
0        1.0       A1  12-Jan-04  331844.007400         NaN
1        2.0       A1   3-Jan-04  441139.807300         NaN
2        3.0       A1  15-Jan-04   32480.004010         NaN
3        4.0       A1  25-Jan-04   90636.966530         NaN
4        5.0       A1  17-Jan-05    1581.969829         NaN
...      ...      ...        ...            ...         ...
1518     NaN      NaN        NaN            NaN         NaN
1519     NaN      NaN        NaN            NaN         NaN
1520     NaN      NaN        NaN            NaN         NaN
1521     NaN      NaN        NaN            NaN         NaN
1522     NaN      NaN        NaN            NaN         NaN

[1523 rows x 5 columns]

In [15]:
Spend.rename(columns={"Costomer":"Customer"},inplace= True)
Spend

      Sl No: Customer      Month        Type  Amount
0          1       A1  12-Jan-04   JEWELLERY  473776
1          2       A1   3-Jan-04       PETRO  335579
2          3       A1  15-Jan-04     CLOTHES  371041
3          4       A1  25-Jan-04        FOOD  141178
4          5       A1  17-Jan-05      CAMERA  398404
...      ...      ...        ...         ...     ...
1495    1496      A67   4-Feb-06  BUS TICKET  195841
1496    1497      A68  25-Mar-06  BUS TICKET  284263
1497    1498      A69  31-Mar-06  BUS TICKET  206552
1498    1499      A70  23-Mar-06  BUS TICKET   41025
1499    1500      A71  24-Mar-06  BUS TICKET  101398

[1500 rows x 5 columns]

In [17]:
mean= Credit[Credit["Age"]>18]["Age"].mean()
mean

np.float64(49.29243076923076)

In [19]:
Credit.loc[Credit["Age"]<18, "Age"]= mean
Credit

,Sl No:,Customer,Age,City,Credit Card Product,Limit,Company,Segment
0,1,A1,49.292431,BANGALORE,Gold,"INR 5,00,000.00",C1,Self Employed
1,2,A2,35.534600,CALCUTTA,Silver,"INR 1,00,000.00",C2,Salaried_MNC
2,3,A3,49.292431,COCHIN,Platimum,"INR 10,000.00",C3,Salaried_Pvt
3,4,A4,45.820300,BOMBAY,Platimum,"INR 10,001.00",C4,Govt
4,5,A5,69.663900,BANGALORE,Platimum,"INR 10,002.00",C5,Normal Salary
...,...,...,...,...,...,...,...,...
95,96,A96,29.631600,CHENNAI,Silver,"INR 1,00,000.00",C19,Salaried_Pvt
96,97,A97,20.611800,TRIVANDRUM,Platimum,"INR 10,000.00",C20,Govt
97,98,A98,40.539000,CALCUTTA,Platimum,"INR 10,001.00",C21,Normal Salary
98,99,A99,21.588700,CALCUTTA,Platimum,"INR 10,002.00",C22,Self Employed
99,100,A100,23.607600,COCHIN,Silver,"INR 1,00,000.00",C5,Salaried_MNC

In [25]:
repay.drop("Unnamed: 4", axis=1, inplace= True)

In [26]:
Spend

      Sl No: Customer      Month        Type  Amount
0          1       A1  12-Jan-04   JEWELLERY  473776
1          2       A1   3-Jan-04       PETRO  335579
2          3       A1  15-Jan-04     CLOTHES  371041
3          4       A1  25-Jan-04        FOOD  141178
4          5       A1  17-Jan-05      CAMERA  398404
...      ...      ...        ...         ...     ...
1495    1496      A67   4-Feb-06  BUS TICKET  195841
1496    1497      A68  25-Mar-06  BUS TICKET  284263
1497    1498      A69  31-Mar-06  BUS TICKET  206552
1498    1499      A70  23-Mar-06  BUS TICKET   41025
1499    1500      A71  24-Mar-06  BUS TICKET  101398

[1500 rows x 5 columns]

In [27]:
repay

     Customer      Month         Amount
0          A1  12-Jan-04  331844.007400
1          A1   3-Jan-04  441139.807300
2          A1  15-Jan-04   32480.004010
3          A1  25-Jan-04   90636.966530
4          A1  17-Jan-05    1581.969829
...       ...        ...            ...
1518      NaN        NaN            NaN
1519      NaN        NaN            NaN
1520      NaN        NaN            NaN
1521      NaN        NaN            NaN
1522      NaN        NaN            NaN

[1523 rows x 3 columns]